Revit 2027 API
EnergyAnalysisOpening.OriginatingElementName Property
 The name for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginatingElementName { get; }
Public ReadOnly Property OriginatingElementName As String
	Get
public:
property String^ OriginatingElementName {
	String^ get ();
}
member OriginatingElementName : string with get
Property Value
String
Remarks
 Opening elements get an originating element assigned according to the below described schema, based on associative room bounding element:
(Family Name) : (Family Type)
Sample: Basic Wall : Cast Concrete Wall 12"
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace